/*Напишите программу, которая принимает на вход трёхзначное число 
и на выходе показывает вторую цифру этого числа.*/
Console.WriteLine ("Vvedite trehznachnoe chislo a");
string a = (Console.ReadLine());
Console.WriteLine(a[1]);